Catalogs/Скрипты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Скрипты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстСкрипта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоИсполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МестаИсполненияСкрипта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Переменные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПеременнаяКонтекста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтекстВыполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементКонтекста</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.КонтекстВыполненияСкрипта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Скрипты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуКонтекстаВыполнения();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКонтекстаВыполнения()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	КонтекстВыполненияСкрипта.Ссылка КАК КонтекстВыполнения
					|ИЗ
					|	ПланВидовХарактеристик.КонтекстВыполненияСкрипта КАК КонтекстВыполненияСкрипта";
	
	Результат = Запрос.Выполнить();  
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = Объект.КонтекстВыполнения.НайтиСтроки(Новый Структура("ЭлементКонтекста", Выборка.КонтекстВыполнения));
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.КонтекстВыполнения.Добавить();	
			НоваяСтрока.ЭлементКонтекста = Выборка.КонтекстВыполнения;
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры // ЗаполнитьТаблицуКонтекстаВыполнения()
  
&НаКлиенте
Процедура ПрочитатьПараметры(Команда)
	
	ТекстСкрипта = Объект.ТекстСкрипта;
	
	Объект.Переменные.Очистить();
	
	КоличествоВхождений = СтрЧислоВхождений(Объект.ТекстСкрипта, "%");
	НачалоПараметра = Истина;
	ПозицияПредыдущегоСимвола = 0; 
	
	Для СчетчикВхождений = 1 По КоличествоВхождений Цикл
		
		ПозицияТекущегоСимвола = СтрНайти(ТекстСкрипта, "%", , ПозицияПредыдущегоСимвола + 1);
		
		Если Не НачалоПараметра Тогда
			Параметр = Сред(ТекстСкрипта, ПозицияПредыдущегоСимвола + 1, ПозицияТекущегоСимвола - (ПозицияПредыдущегоСимвола + 1));
			НоваяСтрокаПараметров = Объект.Переменные.Добавить();
			НоваяСтрокаПараметров.Параметр = Параметр;	
		КонецЕсли;	
		
		ПозицияПредыдущегоСимвола = ПозицияТекущегоСимвола;
		
		НачалоПараметра = Не НачалоПараметра;
		
	КонецЦикла;
	
КонецПроцедуры
